{
	"name": "Streadata.io API Gallery - AWS Elastic Load Balancing",
	"description": "This is a repository of aws elastic load balancing APIs, self-contained as a Github repository, with HTML and YAML representations of the APIs and their surrounding operations.",
	"image": "http://template.streamdata.gallery/assets/aws-elastic-load-balancing.png",
	"created": "2018-02-24",
	"modified": "2018-08-29",
	"url": "http://aws-elastic-load-balancing.streamdata.gallery/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "AWS Elastic Load Balancing",
			"x-api-slug": "aws-elastic-load-balancing",
			"description": "Elastic Load Balancing automatically distributes incoming application traffic across multiple Amazon EC2 instances. It enables you to achieve fault tolerance in your applications, seamlessly providing the required amount of load balancing capacity needed to route application traffic.Elastic Load Balancing offers two types of load balancers that both feature high availability, automatic scaling, and robust security. These include theClassic Load Balancerthat routes traffic based on either application or network level information, and theApplication Load Balancerthat routes traffic based on advanced application level information that includes the content of the request. The Classic Load Balancer is ideal for simple load balancing of traffic across multiple EC2 instances, while the Application Load Balancer is ideal for applications needing advanced routing capabilities, microservices, and container-based architectures. Application Load Balancer offers ability to route traffic to multiple services or load balance across multiple ports on the same EC2 instance.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Compute_ElasticLoadBalancing.png",
			"humanURL": "https://aws.amazon.com/elasticloadbalancing/",
			"baseURL": ":///",
			"tags": "AWS Elastic Load Balancing",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-organizations/aws-elastic-load-balancing/master/_listings/aws-elastic-load-balancing/openapi.md"
				}
			]
		}
	],
	"tags": "AWS Elastic Load Balancing",
	"include": [
		{
			"name": "AWS Elastic Load Balancing",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-organizations/aws-elastic-load-balancing/master/_listings/aws-elastic-load-balancing/apis.yaml"
		}
	]
}